<a href="https://colab.research.google.com/github/binliu0630/Data_Manipulation/blob/master/Minimally_Sufficient_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- Inspired by https://colab.research.google.com/drive/1_9fwgpRrQupG1uBunaS2-ySfr0dXdfcb#scrollTo=DvKPqCGSJpuz

- Selecting a single column of data
- The deprecated ix indexer
- Selection with at and iat
read_csv vs read_table duplication
isna vs isnull and notna vs notnull
Arithmetic and Comparison Operators and their Corresponding Methods
Builtin Python functions vs Pandas methods with the same name
Standardizing groupby aggregation
Handling a MultiIndex
The similarity between groupby, pivot_table and crosstab
pivot vs pivot_table
The similarity between melt and stack
The similarity between pivot and unstack

**Read in data**
- Only use read_csv to read in delimitted text files

In [0]:
import pandas as pd

data = pd.read_csv('https://ed-public-download.app.cloud.gov/downloads/Most-Recent-Cohorts-Scorecard-Elements.csv') # instead of pd.read_table('', delimiter=', ')

In [3]:
data.head(2)

   UNITID   OPEID  ...  OMAWDP8_PARTTIME_POOLED_SUPP OMENRUP_PARTTIME_POOLED_SUPP
0  100654  100200  ...                        0.2635                       0.2852
1  100663  105200  ...                        0.3977                       0.2008

[2 rows x 190 columns]

**Selecting data**
- The brackets are a superset of dot notation
- Every trace of ix should be removed and replaced with loc or iloc

In [0]:
data['CITY'] # instead of data.CITY

In [0]:
data.loc[:, ['CITY', 'STABBR']] # instead of data.ix

In [0]:
data.iloc[:, 1:3]

**About NA**

- only use **isna** and **notna**,matching the names of the other missing value methods **dropna** and **fillna**.
- You can also avoid ever using **notna** since Pandas provides the inversion operator, ~ to invert boolean DataFrames.

In [0]:
data['UNITID'].isna() # instead of: data['UNITID'].isnull()

**Use the Pandas method over any built-in Python function with the same name.**
- sum(), max(), min()

- Calling sum() essentially creates a Python for loop to iterate through each value one at a time. On the other hand, calling.sum() executes the internal Pandas sum method which is written in C and much faster than iterating with a Python for loop.

In [22]:

data['PBI'].dropna().sum() # instead of: sum(data['PBI'].dropna())

101.0

**Standardizing groupby Aggregation**
- df.groupby('grouping column').agg({'aggregating column': 'aggregating function'})
- df.groupby(['gropuing column']).agg({'colum1': ['sum', 'max'],'column2':['min']})
- Avoid using a MultiIndex. Flatten it after a call to groupby by renaming columns and resetting the index.

In [28]:
data.groupby('CITY').agg({'PBI':['max', 'min']}).head() # instead of: data.groupby('CITY').['PBI'].aggregate('max')

          PBI
          max  min
CITY
ARTESIA   0.0  0.0
Aberdeen  0.0  0.0
Abilene   0.0  0.0
Abingdon  0.0  0.0
Abington  0.0  0.0

In [32]:
# flatten

df = data.groupby('CITY').agg({'PBI':['max', 'min']}).head()
df.columns = ['PBI_MAX', 'PBI_MIN'] # manually assign names
df.reset_index()

       CITY  PBI_MAX  PBI_MIN
0   ARTESIA      0.0      0.0
1  Aberdeen      0.0      0.0
2   Abilene      0.0      0.0
3  Abingdon      0.0      0.0
4  Abington      0.0      0.0

**Use pivot_table when comparing groups**
- use pivot tables to compare values across groups and a groupby when want to continue an analysis. 
- Pivot tables as a finished product. The result of a groupby is going to be in tidy form, which lends itself to easier subsequent analysis, but isn’t as interpretable.
- Use pivot_table over unstack or pivot

In [33]:
data.groupby(['STABBR','CITY']).agg({'PBI':['max', 'min']}).head()

                  PBI
                  max  min
STABBR CITY
AK     Anchorage  0.0  0.0
       Barrow     0.0  0.0
       Fairbanks  0.0  0.0
       Juneau     0.0  0.0
       Palmer     0.0  0.0

In [36]:
data.pivot_table(index = ['STABBR', 'CITY'], values = 'PBI', aggfunc=['max','min']).head()

                  max  min
                  PBI  PBI
STABBR CITY
AK     Anchorage  0.0  0.0
       Barrow     0.0  0.0
       Fairbanks  0.0  0.0
       Juneau     0.0  0.0
       Palmer     0.0  0.0

**Use melt over stack because it allows you to rename columns and it avoids a MultiIndex**

In [41]:
data = data.loc[:, ['OPEID', 'CITY', 'HCM2', 'PBI']]
data.head(2)

    OPEID        CITY  HCM2  PBI
0  100200      Normal     0  0.0
1  105200  Birmingham     0  0.0

In [47]:
data.melt(id_vars = ['CITY','OPEID'], var_name = 'measures', value_name = 'numbers' ).head() # could rename the column name

         CITY    OPEID measures  numbers
0      Normal   100200     HCM2      0.0
1  Birmingham   105200     HCM2      0.0
2  Montgomery  2503400     HCM2      0.0
3  Huntsville   105500     HCM2      0.0
4  Montgomery   100500     HCM2      0.0

In [48]:
data.stack()

0     OPEID              100200
      CITY               Normal
      HCM2                    0
      PBI                     0
1     OPEID              105200
      CITY           Birmingham
      HCM2                    0
      PBI                     0
2     OPEID             2503400
      CITY           Montgomery
      HCM2                    0
      PBI                     0
3     OPEID              105500
      CITY           Huntsville
      HCM2                    0
      PBI                     0
4     OPEID              100500
      CITY           Montgomery
      HCM2                    0
      PBI                     0
5     OPEID              105100
      CITY           Tuscaloosa
      HCM2                    0
      PBI                     0
6     OPEID              100700
      CITY       Alexander City
      HCM2                    0
      PBI                     0
7     OPEID              100800
      CITY               Athens
                     ...
7102  OPEID             4220901
      CITY     Highland Heights
      HCM2                    0
7103  OPEID             4224601
      CITY             Ambridge
      HCM2                    0
7104  OPEID              108131
      CITY               Tucson
      HCM2                    0
7105  OPEID              108161
      CITY     Lake Havasu City
      HCM2                    0
7106  OPEID              108162
      CITY             Thatcher
      HCM2                    0
7107  OPEID              108163
      CITY                 Yuma
      HCM2                    0
7108  OPEID             4223701
      CITY             San Jose
      HCM2                    0
7109  OPEID             4228101
      CITY            Lancaster
      HCM2                    0
7110  OPEID             4221501
      CITY               Malden
      HCM2                    0
7111  OPEID             4182601
      CITY     Lauderdale Lakes
      HCM2                    0
Length: 27923, dtype: object